//
//  Localizable.strings
//  Stats
//
//  Created by Serhiy Mytrovtsiy on 27/08/2020.
//  Using Swift 5.0.
//  Running on macOS 10.15.
//
//  Copyright © 2020 Serhiy Mytrovtsiy. All rights reserved.
//

// Modules
"CPU" = "CPU";
"Open CPU settings" = "Apri impostazioni CPU";
"GPU" = "GPU";
"Open GPU settings" = "Apri impostazioni GPU";
"RAM" = "RAM";
"Open RAM settings" = "Apri impostazioni RAM";
"Disk" = "Disco";
"Open Disk settings" = "Apri impostazioni Disco";
"Sensors" = "Sensori";
"Open Sensors settings" = "Apri impostazioni Sensori";
"Network" = "Rete";
"Open Network settings" = "Apri impostazioni Rete";
"Battery" = "Batteria";
"Open Battery settings" = "Apri impostazioni Batteria";
"Bluetooth" = "Bluetooth";
"Open Bluetooth settings" = "Apri impostazioni Bluetooth";
"Clock" = "Orologio";
"Open Clock settings" = "Apri impostazioni Orologio";

// Words
"Unknown" = "Sconosciuto";
"Version" = "Versione";
"Processor" = "Processore";
"Memory" = "Memoria";
"Graphics" = "Grafica";
"Close" = "Chiudi";
"Download" = "Scarica";
"Install" = "Installa";
"Cancel" = "Annulla";
"Unavailable" = "Non disponibile";
"Yes" = "Sì";
"No" = "No";
"Automatic" = "Automatico";
"Manual" = "Manuale";
"None" = "Nessuno";
"Dots" = "Punti";
"Arrows" = "Frecce";
"Characters" = "Caratteri";
"Short" = "Corto";
"Long" = "Lungo";
"Statistics" = "Statistiche";
"Max" = "Massimo"; // translategemma:4b
"Min" = "Min";
"Reset" = "Resetta";
"Alignment" = "Allineamento";
"Left alignment" = "Sinistra";
"Center alignment" = "Centro";
"Right alignment" = "Destra";
"Dashboard" = "Pannello di controllo"; // translategemma:4b
"Enabled" = "Abilitato";
"Disabled" = "Disabilitato";
"Silent" = "Silenzioso";
"Units" = "Unità";
"Fans" = "Ventole";
"Scaling" = "Ridimensionamento";
"Linear" = "Lineare";
"Square" = "Quadratico";
"Cube" = "Cubico";
"Logarithmic" = "Logaritmico";
"Fixed scale" = "Scala fissa";
"Cores" = "Core";
"Settings" = "Impostazioni";
"Name" = "Nome";
"Format" = "Formato";
"Turn off" = "Disattiva";
"Normal" = "Normale"; // translategemma:4b
"Warning" = "Avviso";
"Critical" = "Critico";
"Usage" = "Utilizzo";
"2 minutes" = "2 minuti";
"3 minutes" = "3 minuti";
"10 minutes" = "10 minuti";
"Import" = "Importa";
"Export" = "Esporta";
"Separator" = "Separatore";
"Read" = "Lettura";
"Write" = "Scrittura";
"Frequency" = "Frequenza";
"Save" = "Salva"; // translategemma:4b
"Run" = "Esegui"; // translategemma:4b
"Stop" = "Smetta"; // translategemma:4b
"Uninstall" = "Disinstallare"; // translategemma:4b
"1 sec" = "1 secondo"; // translategemma:4b
"2 sec" = "2 secondi"; // translategemma:4b
"3 sec" = "3 secondi"; // translategemma:4b
"5 sec" = "5 secondi"; // translategemma:4b
"10 sec" = "10 secondi"; // translategemma:4b
"15 sec" = "15 secondi"; // translategemma:4b
"30 sec" = "30 secondi"; // translategemma:4b
"60 sec" = "60 secondi"; // translategemma:4b

// Setup
"Stats Setup" = "Configurazione Stats";
"Previous" = "Precedente";
"Previous page" = "Pagina precedente";
"Next" = "Successivo";
"Next page" = "Pagina successiva";
"Finish" = "Completa";
"Finish setup" = "Completa configurazione";
"Welcome to Stats" = "Stats ti dà il benvenuto";
"welcome_message" = "Grazie per aver scelto Stats, un sistema di monitoraggio del sistema dalla menu bar gratuito e open source per macOS.";
"Start the application automatically when starting your Mac" = "Avvia l'applicazione automaticamente all'accensione del Mac";
"Do not start the application automatically when starting your Mac" = "Non avviare l'applicazione automaticamente all'accensione del Mac";
"Do everything silently in the background (recommended)" = "Gestisci autonomamente in background (consigliato)";
"Check for a new version on startup" = "Verifica la disponibilità di nuove versioni all'avvio";
"Check for a new version every day (once a day)" = "Verifica la disponibilità di nuove versioni ogni giorno (una volta al giorno)";
"Check for a new version every week (once a week)" = "Verifica la disponibilità di nuove versioni ogni settimana (una volta a settimana)";
"Check for a new version every month (once a month)" = "Verifica la disponibilità di nuove versioni ogni mese (una volta al mese)";
"Never check for updates (not recommended)" = "Non verificare mai la disponibilità di nuove versioni (sconsigliato)";
"Anonymous telemetry for better development decisions" = "Telemetria anonima per decisioni di sviluppo migliori";
"Share anonymous telemetry data" = "Condividi dati anonimi di telemetria";
"Do not share anonymous telemetry data" = "Non condividere dati anonimi di telemetria";
"The configuration is completed" = "Configurazione completata";
"finish_setup_message" = "È tutto pronto!\nStats è un software open source gratuito, e lo rimarrà per sempre.\nSe ti piace, dacci il tuo supporto: è sempre ben accetto!";

// Alerts
"New version available" = "Nuova versione disponibile";
"Click to install the new version of Stats" = "Clicca per installare la nuova versione di Stats";
"Successfully updated" = "Aggiornato con successo";
"Stats was updated to v" = "Stats è stato aggiornato alla v%0";
"Reset settings text" = "Tutte le impostazioni saranno resettate e l'applicazione sarà riavviata. Sei sicuro di volerlo fare?";
"Support text" = "Grazie per aver usato Stats!\n\nIl mantenimento e il miglioramento di questo progetto open-source richiede tempo e risorse. Il vostro sostegno ci aiuta a continuare a fornire un'applicazione gratuita e affidabile per tutti.\n\nSe trovate Stats utile, prendete in considerazione l'idea di dare un contributo. Ogni piccolo contributo è utile!";

// Settings
"Open Activity Monitor" = "Apri Monitoraggio Attività";
"Report a bug" = "Segnala un bug";
"Support the application" = "Supporta l'applicazione";
"Close application" = "Chiudi applicazione";
"Open application settings" = "Apri le impostazioni dell'applicazione";
"Open dashboard" = "Apri la dashboard";
"No notifications available in this module" = "Notifiche non disponibili per questo modulo";
"Open Calendar" = "Apri Calendario";
"Toggle the module" = "Attiva/disattiva il modulo"; // translategemma:4b

// Application settings
"Update application" = "Aggiorna applicazione";
"Check for updates" = "Controlla aggiornamenti";
"At start" = "All'avvio";
"Once per day" = "Una volta al giorno";
"Once per week" = "Una volta a settimana";
"Once per month" = "Una volta al mese";
"Never" = "Mai";
"Check for update" = "Verifica la disponibilità di nuove versioni";
"Show icon in dock" = "Mostra icona nel dock";
"Start at login" = "Avvia al login";
"Build number" = "Numero Build";
"Import settings" = "Importa impostazioni";
"Export settings" = "Esporta impostazioni";
"Reset settings" = "Resetta impostazioni";
"Pause the Stats" = "Metti in pausa Stats";
"Resume the Stats" = "Riprendi Stats";
"Combined modules" = "Moduli combinati";
"Combined details" = "Dettagli combinati";
"Spacing" = "Spazio";
"Share anonymous telemetry" = "Condividi telemetria anonima";
"Choose file" = "Seleziona file"; // translategemma:4b
"Stress tests" = "Test di stress"; // translategemma:4b

// Dashboard
"Serial number" = "Numero di serie";
"Model identifier" = "Modello";
"Production year" = "Anno di produzione";
"Uptime" = "Tempo di attività";
"Number of cores" = "%0 core";
"Number of threads" = "%0 thread";
"Number of e-cores" = "%0 efficiency core";
"Number of p-cores" = "%0 performance core";
"Disks" = "Dischi"; // translategemma:4b
"Display" = "Schermo"; // translategemma:4b

// Update
"The latest version of Stats installed" = "L'ultima versione di Stats è installata";
"Downloading..." = "Download in corso...";
"Current version: " = "Versione corrente: ";
"Latest version: " = "Ultima versione: ";

// Widgets
"Color" = "Colore";
"Label" = "Etichetta";
"Box" = "Scatola";
"Frame" = "Riquadro";
"Value" = "Valore";
"Colorize" = "Colora";
"Colorize value" = "Valore colorato";
"Additional information" = "Informazioni aggiuntive";
"Reverse values order" = "Inverti ordine valori";
"Base" = "Base";
"Display mode" = "Modalità di visualizzazione";
"One row" = "Una riga";
"Two rows" = "Due righe";
"Mini widget" = "Mini";
"Line chart widget" = "Grafico a linee";
"Bar chart widget" = "Grafico a barre";
"Pie chart widget" = "Grafico a torta";
"Network chart widget" = "Grafico rete";
"Speed widget" = "Velocità";
"Battery widget" = "Batteria";
"Stack widget" = "Stack";
"Memory widget" = "Memoria";
"Static width" = "Larghezza fissa";
"Tachometer widget" = "Tachimetro";
"State widget" = "Widget di stato";
"Text widget" = "Elemento di testo"; // translategemma:4b
"Battery details widget" = "Widget per dettagli della batteria"; // translategemma:4b
"Show symbols" = "Mostra simboli";
"Label widget" = "Etichetta widget";
"Number of reads in the chart" = "Numero di letture nel grafico";
"Color of download" = "Colore del download";
"Color of upload" = "Colore dell'upload";
"Monospaced font" = "Font a larghezza fissa";
"Reverse order" = "Inverti ordine";
"Chart history" = "Durata grafico";
"Default color" = "Predefinito"; // translategemma:4b
"Transparent when no activity" = "Trasparente in assenza di attività";
"Constant color" = "Costante";

// Module Kit
"Open module settings" = "Apri impostazioni modulo";
"Select widget" = "Seleziona il widget %0";
"Open widget settings" = "Apri impostazioni widget";
"Update interval" = "Intervallo di aggiornamento";
"Usage history" = "Cronologia d'uso";
"Details" = "Dettagli";
"Top processes" = "Processi principali";
"Pictogram" = "Pittogramma";
"Module" = "Modulo";
"Widgets" = "Componenti"; // translategemma:4b
"Popup" = "Finestra di dialogo"; // translategemma:4b
"Notifications" = "Notifiche";
"Merge widgets" = "Combina moduli";
"No available widgets to configure" = "Nessun modulo disponibile";
"No options to configure for the popup in this module" = "Nessuna opzione da configurare per le notifiche in questo modulo";
"Process" = "Processo";
"Kill process" = "Chiudi processo";
"Keyboard shortcut" = "Combinazione di tasti"; // translategemma:4b
"Listening..." = "In ascolto..."; // translategemma:4b

// Modules
"Number of top processes" = "Numero di processi principali";
"Update interval for top processes" = "Intervallo d'aggiornamento per processi principali";
"Notification level" = "Livello di notifica";
"Chart color" = "Colore grafico";
"Main chart scaling" = "Scala del grafico principale";
"Scale value" = "Valore scala";
"Text widget value" = "Valore dell'elemento di testo"; // translategemma:4b

// CPU
"CPU usage" = "Utilizzo CPU";
"CPU temperature" = "Temperatura CPU";
"CPU frequency" = "Frequenza CPU";
"System" = "Sistema";
"User" = "Utente";
"Idle" = "Inattiva";
"Show usage per core" = "Mostra uso per core";
"Show hyper-threading cores" = "Mostra hyper-threading core";
"Split the value (System/User)" = "Dividi il valore (Sistema/Utente)";
"Scheduler limit" = "Limite di pianificazione";
"Speed limit" = "Limite velocità";
"Average load" = "Carico medio";
"1 minute" = "1 minuto";
"5 minutes" = "5 minuti";
"15 minutes" = "15 minuti";
"CPU usage threshold" = "Soglia di utilizzo CPU";
"CPU usage is" = "Utilizzo CPU %0";
"Efficiency cores" = "Efficiency core";
"Performance cores" = "Performance core";
"System color" = "Colore sistema";
"User color" = "Colore utente";
"Idle color" = "Colore inattivo";
"Cluster grouping" = "Raggruppamento cluster";
"Efficiency cores color" = "Colore per efficiency core";
"Performance cores color" = "Colore per performance core";
"Total load" = "Carico totale";
"System load" = "Carico sistema";
"User load" = "Carico utente";
"Efficiency cores load" = "Carico efficiency core";
"Performance cores load" = "Carico performance core";
"All cores" = "Tutti i core";

// GPU
"GPU to show" = "GPU da mostrare";
"Show GPU type" = "Mostra il tipo di GPU";
"GPU enabled" = "GPU abilitata";
"GPU disabled" = "GPU disabilitata";
"GPU temperature" = "Temperatura GPU";
"GPU utilization" = "Utilizzo GPU";
"Vendor" = "Produttore";
"Model" = "Modello";
"Status" = "Stato";
"Active" = "Attiva";
"Non active" = "Non attiva";
"Fan speed" = "Velocità ventole";
"Core clock" = "Clock core";
"Memory clock" = "Clock memoria";
"Utilization" = "Utilizzo";
"Render utilization" = "Utilizzo rendering";
"Tiler utilization" = "Utilizzo tassellamento";
"GPU usage threshold" = "Soglia di utilizzo GPU";
"GPU usage is" = "Utilizzo GPU %0";

// RAM
"Memory usage" = "Memoria utilizzata";
"Memory pressure" = "Compressione memoria";
"Total" = "Totale";
"Used" = "Usata";
"App" = "App";
"Wired" = "Cablata";
"Compressed" = "Compressa";
"Free" = "Libera";
"Swap" = "Swap";
"Split the value (App/Wired/Compressed)" = "Dividi il valore (App/Wired/Compressa)";
"RAM utilization threshold" = "Soglia utilizzo RAM";
"RAM utilization is" = "Utilizzo RAM %0";
"App color" = "Colore App";
"Wired color" = "Colore Cablata";
"Compressed color" = "Colore Compressa";
"Free color" = "Colore Libera";
"Free memory (less than)" = "Memoria libera (meno di)";
"Swap size" = "Dimensione swap";
"Free RAM is" = "RAM libera è %0";

// Disk
"Show removable disks" = "Mostra dischi rimovibili";
"Used disk memory" = "Usato %0 su %1";
"Free disk memory" = "Libero %0 su %1";
"Disk to show" = "Disco da mostrare";
"Open disk" = "Apri disco";
"Switch view" = "Cambia visualizzazione";
"Disk utilization threshold" = "Soglia di utilizzo disco";
"Disk utilization is" = "Utilizzo disco %0";
"Read color" = "Colore lettura";
"Write color" = "Colore scrittura";
"Disk usage" = "Utilizzo Disco";
"Total read" = "Totale letto";
"Total written" = "Totale scritto";
"Write speed" = "Lettura";
"Read speed" = "Scrittura";
"Drives" = "Dischi"; // translategemma:4b
"SMART data" = "Dati SMART"; // translategemma:4b

// Sensors
"Temperature unit" = "Unità di temperatura";
"Celsius" = "Celsius";
"Fahrenheit" = "Fahrenheit";
"Save the fan speed" = "Salva la velocità delle ventole";
"Fan" = "Ventola";
"HID sensors" = "Sensori HID";
"Synchronize fan's control" = "Sincronizza ventole";
"Current" = "Corrente";
"Energy" = "Energia";
"Show unknown sensors" = "Mostra sensori sconosciuti";
"Install fan helper" = "Installa estensione ventole";
"Uninstall fan helper" = "Disinstalla estensione ventole";
"Fan value" = "Valore ventola";
"Turn off fan" = "Disattiva la ventola";
"You are going to turn off the fan. This is not recommended action that can damage your mac, are you sure you want to do that?" = "Stai per disattivare la ventola. Questa azione non è consigliata e può danneggiare il tuo mac, sei sicuro di voler proseguire?";
"Sensor threshold" = "Soglia sensore";
"Left fan" = "Ventola sinistra";
"Right fan" = "Ventola destra";
"Fastest fan" = "Ventola più veloce";
"Sensor to show" = "Sensore da visualizzare"; // translategemma:4b

// Network
"Uploading" = "Caricamento"; // translategemma:4b
"Downloading" = "Scarica"; // translategemma:4b
"Public IP" = "IP Pubblico";
"Local IP" = "IP Locale";
"Interface" = "Interfaccia";
"Physical address" = "Indirizzo fisico";
"Refresh" = "Aggiorna";
"Click to copy public IP address" = "Clicca per copiare l'IP pubblico";
"Click to copy local IP address" = "Clicca per copiare l'IP locale";
"Click to copy wifi name" = "Clicca per copiare il nome del wifi";
"Click to copy mac address" = "Clicca per copiare l'indirizzo mac";
"No connection" = "Nessuna connessione";
"Network interface" = "Interfaccia di rete";
"Total download" = "Download totale";
"Total upload" = "Upload totale";
"Reader type" = "Tipo di lettore";
"Interface based" = "Basato sull'interfaccia";
"Processes based" = "Basato sui processi";
"Reset data usage" = "Ripristina l'utilizzo dei dati";
"VPN mode" = "Modalità VPN";
"Standard" = "Standard";
"Security" = "Sicurezza";
"Channel" = "Canale";
"Common scale" = "Scala comune";
"Autodetection" = "Rilevamento automatico";
"Widget activation threshold" = "Soglia di attivamento widget";
"Internet connection" = "Connessione internet";
"Active state color" = "Colore attivo";
"Nonactive state color" = "Colore disattivo";
"Connectivity host (ICMP)" = "Host (ICMP)";
"Leave empty to disable the check" = "Lascia vuoto per disattivare la verifica";
"Connectivity history" = "Cronologia connettività";
"Auto-refresh public IP address" = "Aggiorna automaticamente indirizzo IP pubblico";
"Every hour" = "Ogni ora";
"Every 12 hours" = "Ogni 12 ore";
"Every 24 hours" = "Ogni 24 ore";
"Network activity" = "Attività di rete";
"Last reset" = "Ultimo reset %0 fa";
"Latency" = "Latenza";
"Upload speed" = "Caricamento"; // translategemma:4b
"Download speed" = "Scarica"; // translategemma:4b
"Address" = "Indirizzo"; // translategemma:4b
"WiFi network" = "Rete WiFi"; // translategemma:4b
"Local IP changed" = "L'indirizzo IP locale è stato modificato"; // translategemma:4b
"Public IP changed" = "L'indirizzo IP pubblico è cambiato."; // translategemma:4b
"Previous IP" = "Indirizzo IP precedente: %0"; // translategemma:4b
"New IP" = "Nuovo indirizzo IP: %0"; // translategemma:4b
"Internet connection lost" = "Connessione a Internet persa"; // translategemma:4b
"Internet connection established" = "Connessione a Internet stabilita"; // translategemma:4b

// Battery
"Level" = "Livello";
"Source" = "Sorgente";
"AC Power" = "Alimentazione AC";
"Battery Power" = "Batteria";
"Time" = "Tempo";
"Health" = "Salute";
"Amperage" = "Amperaggio";
"Voltage" = "Tensione";
"Cycles" = "Numero di cicli";
"Temperature" = "Temperatura";
"Power adapter" = "Alimentatore di corrente";
"Power" = "Output";
"Is charging" = "In carica";
"Time to discharge" = "Tempo di scarica";
"Time to charge" = "Tempo di carica";
"Calculating" = "Calcolo in corso";
"Fully charged" = "Carica";
"Not connected" = "Non connesso";
"Low level notification" = "Notifica livello basso";
"High level notification" = "Notifica livello alto";
"Low battery" = "Batteria scarica";
"High battery" = "Batteria carica";
"Battery remaining" = "%0% rimanente";
"Battery remaining to full charge" = "%0% per carica completa";
"Percentage" = "Percentuale";
"Percentage and time" = "Percentuale e tempo";
"Time and percentage" = "Tempo e percentuale";
"Time format" = "Formato del tempo";
"Hide additional information when full" = "Nascondi informazioni addizionali quando piena";
"Last charge" = "Ultima carica";
"Capacity" = "Capacità";
"current / maximum / designed" = "attuale / massima / progettata";
"Low power mode" = "Modalità risparmio energetico";
"Percentage inside the icon" = "Percentuale nell'icona";
"Colorize battery" = "Colora la batteria";
"Charging current" = "Corrente di carica";
"Charging Voltage" = "Tensione di carica";
"Charger state inside the battery" = "Stato del caricatore all'interno della batteria"; // translategemma:4b

// Bluetooth
"Battery to show" = "Batteria da mostrare";
"No Bluetooth devices are available" = "Nessun dispositivo Bluetooth disponibile";

// Clock
"Time zone" = "Fuso Orario";
"Local" = "Locale";
"Calendar" = "Calendario";
"Show week numbers" = "Mostra i numeri della settimana"; // translategemma:4b
"Local time" = "Ora locale";
"Add new clock" = "Aggiungi un nuovo orologio"; // translategemma:4b
"Delete selected clock" = "Elimina l'orologio selezionato"; // translategemma:4b
"Help with datetime format" = "Assistenza per la formattazione di date e orari"; // translategemma:4b

// Colors
"Based on utilization" = "Basato sull'utilizzo";
"Based on pressure" = "Basato sulla pressione";
"Based on cluster" = "Basato sul cluster";
"System accent" = "Accento di sistema";
"Monochrome accent" = "Accento monocromatico";
"Clear" = "Chiaro";
"White" = "Bianco";
"Black" = "Nero";
"Gray" = "Grigio";
"Second gray" = "Secondo grigio";
"Dark gray" = "Grigio scuro";
"Light gray" = "Grigio chiaro";
"Red" = "Rosso";
"Second red" = "Secondo rosso";
"Green" = "Verde";
"Second green" = "Secondo verde";
"Blue" = "Blu";
"Second blue" = "Secondo blu";
"Yellow" = "Giallo";
"Second yellow" = "Secondo giallo";
"Orange" = "Arancione";
"Second orange" = "Secondo arancione";
"Purple" = "Viola";
"Second purple" = "Secondo viola";
"Brown" = "Marrone";
"Second brown" = "Secondo marrone";
"Cyan" = "Ciano";
"Magenta" = "Magenta";
"Pink" = "Rosa";
"Teal" = "Verde acqua";
"Indigo" = "Indaco";
